{"page":1,"results":[{"adult":false,"backdrop_path":"/oDjYKoXhobUhpib08ly2UKLFKZf.jpg","genre_ids":[18,10759],"id":1755,"origin_country":["US"],"original_language":"en","original_name":"Beyond the Break","overview":"Four passionate women with diverse backgrounds pursue their dreams of becoming professional surfers. But in order to remain afloat, each of them must overcome issues to capture surf stardom from WaveSync, a struggling surf company eager to reinvigorate itself.","popularity":9.907499999999999,"poster_path":"/c9KCHnm0d4hiFy188sVWuUc46Tp.jpg","first_air_date":"2006-06-02","name":"Beyond the Break","vote_average":3.0,"vote_count":2},{"adult":false,"backdrop_path":"/66ieYewiusGZsUAbJGuefdo1GpS.jpg","genre_ids":[80,18,9648],"id":1427,"origin_country":["GB"],"original_language":"en","original_name":"Broadchurch","overview":"The murder of a young boy in a small coastal town brings a media frenzy, which threatens to tear the community apart.","popularity":23.4225,"poster_path":"/2NhBFUTg5KVBmGwafxtLwVdsqrr.jpg","first_air_date":"2013-03-04","name":"Broadchurch","vote_average":7.932,"vote_count":866},{"adult":false,"backdrop_path":"/yydMYsGJqwiQBs79nqPDFzjaCyi.jpg","genre_ids":[35,18],"id":195324,"origin_country":["PH"],"original_language":"tl","original_name":"Lulu","overview":"Two women's paths cross when they are both in the middle of their personal crossroads. Will they find love when they need it the least? Devastated by a break-up, the naturally bubbly and outspoken Sophie wants to disconnect from the world. After deactivating her social media accounts, she escapes to her beach front AirBnB house, also meaning to rehabilitate it. But everything she does is turning out to be a disaster. In fact, Sophie believes that in all her 25 years of existence, she has not done anything right. But when Abi arrives in her house and walks into her life, it all feels just right.","popularity":1.0050000000000001,"poster_path":"/att9nUt0W9cpTGAoWMZSt3miwvB.jpg","first_air_date":"2022-03-17","name":"Lulu","vote_average":1.0,"vote_count":0},{"adult":false,"backdrop_path":"/a33o3TvM7PVSWo3bs91fQTnMTm5.jpg","genre_ids":[10766,18],"id":27657,"origin_country":["BR"],"original_language":"pt","original_name":"Top Model","overview":"Maria Eduarda \"Duda\" Pinheiro is a successful top model. After being hired to model Covery brand clothes, she meets the Kundera brothers, Alex and Gaspar, owners of the company. Gaspar, a former beatnik, is over 40 but still practices surfing, lives in a beach-side house and raises five children: Elvis (named after Elvis Presley), Ringo (Starr), Jane (Fonda), Olívia (Newton-John) and (John) Lennon, all from different mothers who left them with him. Anastácia \"Naná\" Passos, Duda's friend and mentor, loves him platonically, and rivalizes with Mariza Borges over him. Alex by contrast is a yuppie. He and their mother Morgana have a love-hate relationship and rivalry with his brother over Morgana's attention and the company. Alex begins to love Duda, however she falls in love with Lucas, a graffiti artist who is on the run from the São Paulo police due to his involvement in a crime there. He is also searching for his real father, and thinks it's either Alex or Gaspar.","popularity":152.91750000000002,"poster_path":"/i0KFKX1yO9Tig2pZvJdohMMCo3i.jpg","first_air_date":"1989-09-18","name":"Top Model","vote_average":7.0,"vote_count":11},{"adult":false,"backdrop_path":"/qA0ikmnPGzi1FEGOEObVaC4FeXX.jpg","genre_ids":[18,10759,80],"id":739,"origin_country":["US"],"original_language":"en","original_name":"Acapulco H.E.A.T.","overview":"Acapulco H.E.A.T. is a 1993 syndicated television series that followed the Hemisphere Emergency Action Team [H.E.A.T.], a group of top-secret agents based in Acapulco, Mexico and recruited by C-5, a secret government coalition, to fight terrorism and international crime. The team kept a low profile, by acting as models and photographers who represented a Beach Fashion enterprise.","popularity":12.5175,"poster_path":"/xh688GLiHihEqmf2yyBwmgcBOv5.jpg","first_air_date":"1993-09-28","name":"Acapulco H.E.A.T.","vote_average":5.1,"vote_count":20},{"adult":false,"backdrop_path":null,"genre_ids":[18],"id":1583,"origin_country":["CA"],"original_language":"en","original_name":"Falcon Beach","overview":"Set in a quiet town where locals and summer visitors mingle, and relationships change as quickly as the tide. Will the hot days of summer prove long enough to resolve the abundant seduction and scandal of Falcon Beach?","popularity":3.785,"poster_path":"/sK3g107DBXxwNjQ4n2skm3HL0bX.jpg","first_air_date":"2006-01-05","name":"Falcon Beach","vote_average":4.5,"vote_count":4},{"adult":false,"backdrop_path":"/6rhSLEiDRWvw9MpK94KawXDz8sg.jpg","genre_ids":[18,10759,80,10768],"id":50,"origin_country":["US"],"original_language":"en","original_name":"Pacific Blue","overview":"Pacific Blue is an American crime drama series about a team of police officers with the Santa Monica Police Department who patrolled its beaches on bicycles. The show ran for five seasons on the USA Network, from March 2, 1996 to April 9, 2000, with a total of one hundred and one episodes. Often compared as \"Baywatch on bikes,\" the series enjoyed a popular run among the Network's viewers, and was popular in France, Israel, Sweden, Bulgaria, Norway, Spain, Russia, Austria, Germany, Italy, South America, Canada, Denmark, Poland, and other foreign markets.","popularity":221.635,"poster_path":"/lVyEixUIkSWSuUQ1RO4fQMXcXgB.jpg","first_air_date":"1996-03-02","name":"Pacific Blue","vote_average":5.4,"vote_count":85},{"adult":false,"backdrop_path":"/1HiRzaRcF7WxTMFnroszv2ICcWj.jpg","genre_ids":[18,35],"id":109,"origin_country":["AU"],"original_language":"en","original_name":"Blue Water High","overview":"Blue Water High is an Australian television drama series, broadcast by the Australian Broadcasting Corporation on ABC1 and on Austar/Foxtel Nickelodeon channel in Australia and on various channels in many other countries. Each season follows the lives of a young group of students at Solar Blue, a high-performance surf academy where several lucky 16-year-olds are selected for a 12-month-long surfing program on Sydney's northern beaches.\n\nThere are three series in Blue Water High. The first two series were screened in 2005 and 2006 and the producers did not intend to create a third series. However, due to popular demand by fans, they relented and made one more series with only Kate Bell returning in a main role. Series three ended with the closure of Solar Blue, indicating that the show would most likely not continue.","popularity":7.525,"poster_path":"/tHnD4vbVGorHal7zuEyiSir1V1h.jpg","first_air_date":"2005-05-11","name":"Blue Water High","vote_average":7.1,"vote_count":19},{"adult":false,"backdrop_path":null,"genre_ids":[18,10766],"id":31753,"origin_country":["US"],"original_language":"en","original_name":"Coastal Dreams","overview":"Coastal Dreams is a 24-episode online soap opera produced by NBC in 2007.\n\nThe series stars Danica Stewart, Tanee McCall, Elena Campbell-Martinez, Kam Heskin, Charlie Koznick, Ken Luckey, and Noah Schuffman. It features two beautiful women named Zoe and Stacey, whose plans for fun on the beach is interrupted by deadly danger. The series is executive produced, written and created by Rick Draughon and directed by Mark Cole.\n\nZoe needs to escape her Texas hometown after her boyfriend goes more than a little psycho on her. She packs up her bathing suit, grabs her best friend and fellow college grad Stacey and heads to California to visit her wealthy cousin April. Staying in April's seaside mansion seems to like the dream vacation, especially after the girls meet April's hot boyfriend Christian and the dreamy local deputy, Will. the worse quickly though when Zoe starts receiving menacing text messages from her ex...and the locals reveal their ulterior motives.\n\nThis show aired every Tuesday and Thursday at nbc.com.","popularity":1.24,"poster_path":null,"first_air_date":"2007-10-02","name":"Coastal Dreams","vote_average":5.0,"vote_count":1},{"adult":false,"backdrop_path":"/2SOcbkkmEO0SugGNviPpqjlePJQ.jpg","genre_ids":[18],"id":257823,"origin_country":["PH"],"original_language":"tl","original_name":"Marahuyo Project","overview":"Join King as he journeys through the highly traditional town of Marahuyo, meeting new friends and finding love along the way as he lobbies to create the first LGBTQIA+ org in their campus.","popularity":1.6,"poster_path":"/yZbrIwKLHxblPkIHI52gEinitij.jpg","first_air_date":"2024-06-24","name":"Marahuyo Project","vote_average":8.5,"vote_count":2},{"adult":false,"backdrop_path":"/4f2Cj0GLuvcrA8w87F1AdWGqwoW.jpg","genre_ids":[18],"id":4106,"origin_country":["US"],"original_language":"en","original_name":"Summerland","overview":"Bradin, Nikki and Derrick are 3 kids from an average normal Kansas household. Their whole life is thrown upside-down when their parents are tragically killed in a car accident. Ava Gregory (their aunt) gets custody of her niece and nephews and they move into her Californian home (in Summerland). Ava, a struggling clothes designer, lives with her best friend and business partner, Susannah Rexford, her friend, an ex- pro.surfer, Jay Robertson and her ex-boyfriend, real estate agent, Johnny Durrant. All four of them are highly unequipped to handle children and are not use to including them in their everyday lives.","popularity":7.21,"poster_path":"/mvdhBaU7CaIaZzoO4SgjPcyxXAM.jpg","first_air_date":"2004-06-01","name":"Summerland","vote_average":6.7,"vote_count":28},{"adult":false,"backdrop_path":"/o2F0cIIuEOuai7Vzv0Rh7YvRppT.jpg","genre_ids":[10759,18,80],"id":4386,"origin_country":["US"],"original_language":"en","original_name":"Baywatch","overview":"Join the Baywatch lifeguards on their thrilling adventures filled with beautiful beaches and those iconic red swimsuits.","popularity":105.75999999999999,"poster_path":"/34t8WxHn1OcIVpcTxmjYmjX9tE4.jpg","first_air_date":"1989-04-23","name":"Baywatch","vote_average":5.9,"vote_count":485},{"adult":false,"backdrop_path":"/nh1tdRxIVxKFUv2d8X2OkUcnS2f.jpg","genre_ids":[18,10764],"id":3605,"origin_country":["US"],"original_language":"en","original_name":"Laguna Beach","overview":"Like other teens in California, the lives of the Laguna Beach teenagers are filled with sandy beaches, beautiful friends and love triangles. But unlike other teens, they had cameras following them around. It may look like fantasyland, but they're not acting: they really are this rich and beautiful. For them, life really is a day at the beach.","popularity":12.809999999999999,"poster_path":"/40SJwdcrq4AQb5EWMRSbfb23SKI.jpg","first_air_date":"2004-09-28","name":"Laguna Beach","vote_average":6.4,"vote_count":18},{"adult":false,"backdrop_path":"/3pFanGqNJOVxtXOZSUAMfyWeXMY.jpg","genre_ids":[18],"id":232399,"origin_country":["FI"],"original_language":"fi","original_name":"Rantabaari","overview":"","popularity":13.765,"poster_path":"/wLmlw5KIDcQvfr20UqtCqfQJlsP.jpg","first_air_date":"2019-09-10","name":"Rantabaari","vote_average":0.0,"vote_count":0},{"adult":false,"backdrop_path":"/vwtqkBpuoLPdAnYpO3JITcVOuXe.jpg","genre_ids":[18,35],"id":33860,"origin_country":["GB"],"original_language":"en","original_name":"Mapp & Lucia","overview":"Comedy, set during the 1930s, of social rivalry between two women in a small English town. New arrival Lucia (Geraldine McEwan, as Emmeline \"Lucia\" Lucas) creates challenges to the established local social dominance of Miss Elizabeth Mapp (Prunella Scales).","popularity":5.1075,"poster_path":"/6jWJBb1YN7CyDhrBCpX9mgD0m6t.jpg","first_air_date":"1985-04-14","name":"Mapp & Lucia","vote_average":6.0,"vote_count":6},{"adult":false,"backdrop_path":null,"genre_ids":[18],"id":124039,"origin_country":["CN"],"original_language":"zh","original_name":"海滩","overview":"","popularity":9.6725,"poster_path":"/al4JxY3rPcFMw9f0piN5DCjp11t.jpg","first_air_date":"2003-07-25","name":"Beach","vote_average":0.0,"vote_count":0},{"adult":false,"backdrop_path":"/1wrHiJP9NgIWYHRCWsjm3c2RA5V.jpg","genre_ids":[35,18],"id":204489,"origin_country":["TH"],"original_language":"th","original_name":"ฉันนี่แหละนายอาทิตย์","overview":"Sun is a debt collector unable to successfully collect a debt. Thai is a new debt collector, his rival. Instead of collecting debt, Thai gets Mangkorn in exchange for interest.  Sun's father presses him to collect a debt from Athit. Without it, he will go bankrupt. On the way to Athit island, Sun meets Talay and Nai, friends and henchmen of Athit. Sun plans to get close to Athit through the two. Athit is unimpressed and attempts to send Sun back to Bangkok, but Sun stubbornly refuses.","popularity":4.875,"poster_path":"/ixWWtYCW2RMy08HQnePGKn4P4Rv.jpg","first_air_date":"2022-06-29","name":"Even Sun","vote_average":7.6,"vote_count":5},{"adult":false,"backdrop_path":"/xElGHgmnX6PCDOhAGeygv48B0Se.jpg","genre_ids":[18,80,10766],"id":9761,"origin_country":["US"],"original_language":"en","original_name":"2000 Malibu Road","overview":"2000 Malibu Road is a prime time American soap opera that aired on CBS in the summer of 1992. The series stars Drew Barrymore, Jennifer Beals, Brian Bloom, Scott Bryce, Lisa Hartman, Tuesday Knight, and Michael T. Weiss.","popularity":35.567499999999995,"poster_path":"/ciUinGmABNagG44LSxYK3eAyzfN.jpg","first_air_date":"1992-08-23","name":"2000 Malibu Road","vote_average":6.5,"vote_count":3},{"adult":false,"backdrop_path":"/yKh5Ic5dSI3O7n4TeBRMrThMHTg.jpg","genre_ids":[18],"id":9657,"origin_country":["AU","US"],"original_language":"en","original_name":"Chopper Squad","overview":"Chopper Squad is an Australian television series produced by the Reg Grundy Organisation for the 0-10 Network.\n\nThe series was based around the work of a helicopter rescue team operating on Dee Why beach in Sydney. It has been said that the American series Baywatch was based upon Chopper Squad.","popularity":5.37,"poster_path":"/tq72nT58uqsJaId0kOjOaLraaaV.jpg","first_air_date":"1978-03-13","name":"Chopper Squad","vote_average":5.0,"vote_count":1},{"adult":false,"backdrop_path":"/mSBdRkNrncpV9Qj4aFKmxhzyIID.jpg","genre_ids":[18,35],"id":100333,"origin_country":["IT"],"original_language":"it","original_name":"Summertime","overview":"A modern love story set during the summer on Italy’s Adriatic Coast. An undeniable attraction brings together Ale and Summer, who come from very different worlds. For both, these holidays will be an unforgettable journey that will take them far from who they were before they met.","popularity":7.1425,"poster_path":"/9PCmLDADfqrCnnxOo8yeM5AjnWY.jpg","first_air_date":"2020-04-29","name":"Summertime","vote_average":6.8,"vote_count":437}],"total_pages":2126,"total_results":42502}